tap "jorgelbg/tap"
tap "oven-sh/bun"
brew "fd"
brew "fzf"
brew "just"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "pass"
brew "rust"
brew "tealdeer"
brew "typst"
brew "uv"
brew "yazi"
brew "jorgelbg/tap/pinentry-touchid"
brew "oven-sh/bun/bun"
cask "ghostty"
cask "notion-calendar"
cask "raycast"
cask "zen"
