tap "jorgelbg/tap"
tap "oven-sh/bun"
brew "browserpass"
brew "fd"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "opencode"
brew "pass"
brew "podman"
brew "ripgrep"
brew "tailscale"
brew "tealdeer"
brew "tree-sitter-cli"
brew "typst"
brew "uv"
brew "yazi"
brew "jorgelbg/tap/pinentry-touchid"
brew "oven-sh/bun/bun"
cask "ghostty"
cask "signal"
cask "notion-calendar"
cask "raycast"
cask "spotify"
cask "zen"
