brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "podman"
brew "ripgrep"
brew "rust"
brew "tealdeer"
brew "typst"
brew "yazi"
cask "arc"
cask "cursor"
cask "font-maple-mono"
cask "ghostty"
cask "notion-calendar"
cask "notion-mail"
cask "raycast"
cask "visual-studio-code"
cask "zen"
vscode "c-and-t-software.mtbassist"
vscode "cschlosser.doxdocgen"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "onethinx.cortex-gdb"
vscode "oracle.oracle-java"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
