brew "bat"
brew "eza"
brew "fzf"
brew "neovim"
brew "node"
brew "podman"
brew "ripgrep"
brew "rust"
brew "spotify_player"
brew "tealdeer"
brew "typst"
brew "yazi"
cask "arc"
cask "cursor"
cask "font-maple-mono"
cask "ghostty"
cask "notion-calendar"
cask "notion-mail"
cask "raycast"
