brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "go"
brew "just"
brew "neovim"
brew "node"
brew "opencode"
brew "openjdk@21"
brew "podman"
brew "recutils"
brew "ripgrep"
brew "rust"
brew "tealdeer"
brew "typst"
brew "yazi"
cask "cursor"
cask "font-maple-mono"
cask "ghostty"
cask "notion-calendar"
cask "notion-mail"
cask "raycast"
cask "visual-studio-code"
vscode "c-and-t-software.mtbassist"
vscode "cschlosser.doxdocgen"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "mshr-h.veriloghdl"
vscode "onethinx.cortex-gdb"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
